EmbeddedSystemClass/ESP32-IOT-Smart-Home-System/main/src/Bluetooth/esp32iot_bluetooth.c
#include "esp32iot_bluetooth.h"

void print_properities(esp_gatt_char_prop_t property){

    if(property & ESP_GATT_CHAR_PROP_BIT_BROADCAST)
        printf("| ESP_GATT_CHAR_PROP_BIT_BROADCAST |");
    if(property & ESP_GATT_CHAR_PROP_BIT_READ)
        printf("| ESP_GATT_CHAR_PROP_BIT_READ |");
    if(property & ESP_GATT_CHAR_PROP_BIT_WRITE_NR)
        printf("| ESP_GATT_CHAR_PROP_BIT_WRITE_NR |");
    if(property & ESP_GATT_CHAR_PROP_BIT_WRITE)
        printf("| ESP_GATT_CHAR_PROP_BIT_WRITE |");
    if(property & ESP_GATT_CHAR_PROP_BIT_NOTIFY)
        printf("| ESP_GATT_CHAR_PROP_BIT_NOTIFY |");
    if(property & ESP_GATT_CHAR_PROP_BIT_INDICATE)
        printf("| ESP_GATT_CHAR_PROP_BIT_INDICATE |");
    if(property & ESP_GATT_CHAR_PROP_BIT_AUTH)
        printf("| ESP_GATT_CHAR_PROP_BIT_AUTH |");
    if(property & ESP_GATT_CHAR_PROP_BIT_EXT_PROP)
        printf("| ESP_GATT_CHAR_PROP_BIT_EXT_PROP |");

    printf("\n");
}

int hexadecimalToDecimal(char hexVal[])
{   
    int len = strlen(hexVal);
     
    // Initializing base value to 1, i.e 16^0
    int base = 1;
     
    int dec_val = 0;
     
    // Extracting characters as digits from last character
    for (int i=len-1; i>=0; i--)
    {   
        // if character lies in '0'-'9', converting 
        // it to integral 0-9 by subtracting 48 from
        // ASCII value.
        if (hexVal[i]>='0' && hexVal[i]<='9')
        {
            dec_val += (hexVal[i] - 48)*base;
                 
            // incrementing base by power
            base = base * 16;
        }
 
        // if character lies in 'A'-'F' , converting 
        // it to integral 10 - 15 by subtracting 55 
        // from ASCII value
        else if (hexVal[i]>='A' && hexVal[i]<='F')
        {
            dec_val += (hexVal[i] - 55)*base;
         
            // incrementing base by power
            base = base*16;
        }
    }
     
    return dec_val;
}

static void start_scan(void)
{
    stop_scan_done = false;
    Isconnecting = false;
    uint32_t duration = 30;
    esp_ble_gap_start_scanning(duration);
}

static void gattc_profile_BA5C_event_handler(esp_gattc_cb_event_t event, esp_gatt_if_t gattc_if, esp_ble_gattc_cb_param_t *param)
{

    esp_ble_gattc_cb_param_t *p_data = (esp_ble_gattc_cb_param_t *)param;

    switch (event) {
    case ESP_GATTC_REG_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_REG_EVT");

        esp_err_t scan_ret = esp_ble_gap_set_scan_params(&ble_scan_params);
        if (scan_ret){
            ESP_LOGE(GATTC_TAG, "set scan params error, error code = %x", scan_ret);
        }
        break;
    /* one device connect successfully, all profiles callback function will get the ESP_GATTC_CONNECT_EVT,
     so must compare the mac address to check which device is connected, so it is a good choice to use ESP_GATTC_OPEN_EVT. */
    case ESP_GATTC_CONNECT_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_CONNECT_EVT");

        break;
    case ESP_GATTC_OPEN_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_OPEN_EVT");

        if (p_data->open.status != ESP_GATT_OK){
            //open failed, ignore the first device, connect the second device
            ESP_LOGE(GATTC_TAG, "connect device failed, status %d", p_data->open.status);
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.conn_device = false;
            //start_scan();
            break;
        }
        memcpy(gl_profile_tab[PROFILE_BA5C_APP_ID].remote_bda, p_data->open.remote_bda, 6);
        gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id = p_data->open.conn_id;
        //gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id = p_data->open.conn_id;
        ESP_LOGI(GATTC_TAG, "conn_id %d, if %d, status %d, mtu %d", p_data->open.conn_id, gattc_if, p_data->open.status, p_data->open.mtu);
        ESP_LOGI(GATTC_TAG, "REMOTE BDA:");
        esp_log_buffer_hex(GATTC_TAG, p_data->open.remote_bda, sizeof(esp_bd_addr_t));
        esp_err_t mtu_ret_BA5C = esp_ble_gattc_send_mtu_req (gattc_if, p_data->open.conn_id);
        if (mtu_ret_BA5C){
            ESP_LOGE(GATTC_TAG, "config MTU error, error code = %x", mtu_ret_BA5C);
        }
        break;
    case ESP_GATTC_CFG_MTU_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_CFG_MTU_EVT");

        if (param->cfg_mtu.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG,"Config mtu failed");
        }
        ESP_LOGI(GATTC_TAG, "status %d, MTU %d, conn_id %d", param->cfg_mtu.status, param->cfg_mtu.mtu, param->cfg_mtu.conn_id);
        esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_uuid.HTU21D_service_uuid);
        esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_uuid.MS5637_service_uuid);
        esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_uuid.Battery_service_uuid);
        
        break;
    case ESP_GATTC_SEARCH_RES_EVT: {
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_SEARCH_RES_EVT");

        bool found_any = false;
        esp_gatt_srvc_id_t *srvc_id = (esp_gatt_srvc_id_t *)&p_data->search_res.srvc_id;
        ESP_LOGI(GATTC_TAG, "conn_id = %x", p_data->search_res.conn_id);
        if (srvc_id->id.uuid.len == ESP_UUID_LEN_128 && !memcmp(srvc_id->id.uuid.uuid.uuid128,BA5C_uuid.HTU21D_service_uuid.uuid.uuid128, ESP_UUID_LEN_128)) {
            ESP_LOGI(GATTC_TAG, "HTU21D service found");
            ESP_LOG_BUFFER_HEX_LEVEL(GATTC_TAG, srvc_id->id.uuid.uuid.uuid128, ESP_UUID_LEN_128, ESP_LOG_INFO);
            
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_get_service = true;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_get_service = false;

            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_start_handle = p_data->search_res.start_handle;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_end_handle = p_data->search_res.end_handle; 
            ESP_LOGI(GATTC_TAG, "service_start_handle: %d | service_end_handle: %d ", p_data->search_res.start_handle, p_data->search_res.end_handle);
            //esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_MS5637_service_uuid);
        }else if (srvc_id->id.uuid.len == ESP_UUID_LEN_128 && !memcmp(srvc_id->id.uuid.uuid.uuid128, BA5C_uuid.MS5637_service_uuid.uuid.uuid128, ESP_UUID_LEN_128)) {
            ESP_LOGI(GATTC_TAG, "MS5637 service found");
            ESP_LOG_BUFFER_HEX_LEVEL(GATTC_TAG, srvc_id->id.uuid.uuid.uuid128, ESP_UUID_LEN_128, ESP_LOG_INFO);
            
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_get_service = true;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_get_service = false;

            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle = p_data->search_res.start_handle;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle = p_data->search_res.end_handle; 
            ESP_LOGI(GATTC_TAG, "service_start_handle: %d | service_end_handle: %d ", p_data->search_res.start_handle, p_data->search_res.end_handle);   
            //esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_Battery_service_uuid);         
        }else if (srvc_id->id.uuid.len == ESP_UUID_LEN_128 && !memcmp(srvc_id->id.uuid.uuid.uuid128, BA5C_uuid.Battery_service_uuid.uuid.uuid128, ESP_UUID_LEN_128)) {
            ESP_LOGI(GATTC_TAG, "Battery service found");
            ESP_LOG_BUFFER_HEX_LEVEL(GATTC_TAG, srvc_id->id.uuid.uuid.uuid128, ESP_UUID_LEN_128, ESP_LOG_INFO);
            
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_get_service = true;

            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_start_handle = p_data->search_res.start_handle;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_end_handle = p_data->search_res.end_handle; 
            ESP_LOGI(GATTC_TAG, "service_start_handle: %d | service_end_handle: %d ", p_data->search_res.start_handle, p_data->search_res.end_handle);   
            //esp_ble_gattc_search_service(gattc_if, param->cfg_mtu.conn_id, &BA5C_Battery_service_uuid);         
        }
       
        break;
    }
    case ESP_GATTC_SEARCH_CMPL_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_SEARCH_CMPL_EVT");
        if (p_data->search_cmpl.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "search service failed, error status = %x", p_data->search_cmpl.status);
            break;
        }
        //ESP_LOG_BUFFER_HEX_LEVEL(GATTC_TAG, p_data->search_cmpl->id.uuid.uuid.uuid128, ESP_UUID_LEN_128, ESP_LOG_INFO);

        uint16_t count = 0;
        uint16_t tmp_count = 0;

        if (gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_get_service){
            ESP_LOGI(GATTC_TAG, "HTU21D_get_service");

            esp_gatt_status_t status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                     p_data->search_cmpl.conn_id,
                                                                     ESP_GATT_DB_CHARACTERISTIC,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_start_handle,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_end_handle,
                                                                     INVALID_HANDLE,
                                                                     &count);
            if (status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0) {
                tmp_count = count;
                char_elem_result_BA5C = (esp_gattc_char_elem_t *)malloc(sizeof(esp_gattc_char_elem_t) * count);
                if (!char_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "gattc no mem");
                }else {


                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_end_handle,
                                                        BA5C_uuid.HTU21D_data_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid data_char error");
                    }else{
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_NOTIFY)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_data_char_handle = char_elem_result_BA5C[0].char_handle;
                            esp_ble_gattc_register_for_notify (gattc_if, gl_profile_tab[PROFILE_BA5C_APP_ID].remote_bda, char_elem_result_BA5C[0].char_handle);
                        }
                    }
                    count = tmp_count;

                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_end_handle,
                                                       BA5C_uuid.HTU21D_status_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid status_char error");
                    }else{  
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_READ)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_status_char_handle = char_elem_result_BA5C[0].char_handle;
                        }
                    }
                    count = tmp_count;

