EmbeddedSystemClass/ESP32-IOT-Smart-Home-System/main/src/Bluetooth/esp32iot_bluetooth.c
                }
                /* free char_elem_result */
                free(char_elem_result_BA5C);
            }else {
                ESP_LOGE(GATTC_TAG, "no char found");
            }
        }else if (gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_get_service){
            ESP_LOGI(GATTC_TAG, "MS5637_get_service");

            esp_gatt_status_t status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                     p_data->search_cmpl.conn_id,
                                                                     ESP_GATT_DB_CHARACTERISTIC,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle,
                                                                     INVALID_HANDLE,
                                                                     &count);
            if (status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0) {
                tmp_count = count;
                char_elem_result_BA5C = (esp_gattc_char_elem_t *)malloc(sizeof(esp_gattc_char_elem_t) * count);
                if (!char_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "gattc no mem");
                }else {
                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle,
                                                        BA5C_uuid.MS5637_data_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid data_char error");
                    }else{
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_NOTIFY)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_data_char_handle = char_elem_result_BA5C[0].char_handle;
                            esp_ble_gattc_register_for_notify (gattc_if, gl_profile_tab[PROFILE_BA5C_APP_ID].remote_bda, char_elem_result_BA5C[0].char_handle);
                        }
                    }
                    count = tmp_count;

                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle,
                                                        BA5C_uuid.MS5637_calibration_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid calibration_cha error");
                    }else{
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_READ)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_calibration_char_handle = char_elem_result_BA5C[0].char_handle;
                        }
                    }
                    count = tmp_count;

                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle,
                                                        BA5C_uuid.MS5637_status_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid status_char error");
                    }else{
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_READ)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_status_char_handle = char_elem_result_BA5C[0].char_handle;
                        }
                    }
                    count = tmp_count;

                }
                /* free char_elem_result */
                free(char_elem_result_BA5C);
            }else {
                ESP_LOGE(GATTC_TAG, "no char found");
            }
        }else if (gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_get_service){
            ESP_LOGI(GATTC_TAG, "Battery_get_service");

            esp_gatt_status_t status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                     p_data->search_cmpl.conn_id,
                                                                     ESP_GATT_DB_CHARACTERISTIC,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_start_handle,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_end_handle,
                                                                     INVALID_HANDLE,
                                                                     &count);
            if (status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0) {
                tmp_count = count;
                char_elem_result_BA5C = (esp_gattc_char_elem_t *)malloc(sizeof(esp_gattc_char_elem_t) * count);
                if (!char_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "gattc no mem");
                }else {
                    if (esp_ble_gattc_get_char_by_uuid( gattc_if,
                                                        p_data->search_cmpl.conn_id,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_start_handle,
                                                        gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_end_handle,
                                                        BA5C_uuid.Battery_data_char_uuid,
                                                        char_elem_result_BA5C,
                                                        &count) != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_char_by_uuid data_char error");
                    }else{
                        /*  Every service have only one char in our 'ESP_GATTS_DEMO' demo, so we used first 'char_elem_result' */
                        if (count > 0 && (char_elem_result_BA5C[0].properties & ESP_GATT_CHAR_PROP_BIT_NOTIFY)){
                            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle = char_elem_result_BA5C[0].char_handle;
                            esp_ble_gattc_register_for_notify (gattc_if, gl_profile_tab[PROFILE_BA5C_APP_ID].remote_bda, char_elem_result_BA5C[0].char_handle);
                        }
                    }
                    count = tmp_count;

