EmbeddedSystemClass/ESP32-IOT-Smart-Home-System/main/src/Bluetooth/esp32iot_bluetooth.c
                }
                /* free char_elem_result */
                free(char_elem_result_BA5C);
            }else {
                ESP_LOGE(GATTC_TAG, "no char found");
            }
        }
        break;
    case ESP_GATTC_REG_FOR_NOTIFY_EVT: {
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_REG_FOR_NOTIFY_EVT");

        if (p_data->reg_for_notify.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "reg notify failed, error status =%x", p_data->reg_for_notify.status);
            break;
        }

        uint16_t count = 0;
        uint16_t notify_en = 1;

        if(p_data->reg_for_notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_data_char_handle){
            ESP_LOGI(GATTC_TAG, "HTU21D reg_for_notify handle: %d", p_data->reg_for_notify.handle);

            esp_gatt_status_t ret_status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         ESP_GATT_DB_DESCRIPTOR,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_start_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_service_end_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_data_char_handle,
                                                                         &count);
            if (ret_status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0){
                descr_elem_result_BA5C = (esp_gattc_descr_elem_t *)malloc(sizeof(esp_gattc_descr_elem_t) * count);
                if (!descr_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "malloc error, gattc no mem");
                }else{
                    ret_status = esp_ble_gattc_get_descr_by_char_handle( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         p_data->reg_for_notify.handle,
                                                                         BA5C_uuid.notify_descr_char_uuid,
                                                                         descr_elem_result_BA5C,
                                                                         &count);
                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_descr_by_char_handle error");
                    }

                    /* Erery char have only one descriptor in our 'ESP_GATTS_DEMO' demo, so we used first 'descr_elem_result' */
                    if (count > 0 && descr_elem_result_BA5C[0].uuid.len == ESP_UUID_LEN_16 && descr_elem_result_BA5C[0].uuid.uuid.uuid16 == ESP_GATT_UUID_CHAR_CLIENT_CONFIG){
                        ret_status = esp_ble_gattc_write_char_descr( gattc_if,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                     descr_elem_result_BA5C[0].handle,
                                                                     sizeof(notify_en),
                                                                     (uint8_t *)&notify_en,
                                                                     ESP_GATT_WRITE_TYPE_RSP,
                                                                     ESP_GATT_AUTH_REQ_NONE);
                    }

                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_write_char_descr error");
                    }

                    /* free descr_elem_result */
                    free(descr_elem_result_BA5C);
                }
            }
            else{
                ESP_LOGE(GATTC_TAG, "decsr not found");
            }
        }else if(p_data->reg_for_notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_data_char_handle){
            ESP_LOGI(GATTC_TAG, "MS5637 reg_for_notify handle: %d", p_data->reg_for_notify.handle);

            esp_gatt_status_t ret_status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         ESP_GATT_DB_DESCRIPTOR,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_start_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_service_end_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_data_char_handle,
                                                                         &count);
            if (ret_status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0){
                descr_elem_result_BA5C = (esp_gattc_descr_elem_t *)malloc(sizeof(esp_gattc_descr_elem_t) * count);
                if (!descr_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "malloc error, gattc no mem");
                }else{
                    ret_status = esp_ble_gattc_get_descr_by_char_handle( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         p_data->reg_for_notify.handle,
                                                                         BA5C_uuid.notify_descr_char_uuid,
                                                                         descr_elem_result_BA5C,
                                                                         &count);
                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_descr_by_char_handle error");
                    }

                    /* Erery char have only one descriptor in our 'ESP_GATTS_DEMO' demo, so we used first 'descr_elem_result' */
                    if (count > 0 && descr_elem_result_BA5C[0].uuid.len == ESP_UUID_LEN_16 && descr_elem_result_BA5C[0].uuid.uuid.uuid16 == ESP_GATT_UUID_CHAR_CLIENT_CONFIG){
                        ret_status = esp_ble_gattc_write_char_descr( gattc_if,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                     descr_elem_result_BA5C[0].handle,
                                                                     sizeof(notify_en),
                                                                     (uint8_t *)&notify_en,
                                                                     ESP_GATT_WRITE_TYPE_RSP,
                                                                     ESP_GATT_AUTH_REQ_NONE);
                    }

                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_write_char_descr error");
                    }

                    /* free descr_elem_result */
                    free(descr_elem_result_BA5C);
                }
            }
            else{
                ESP_LOGE(GATTC_TAG, "decsr not found");
            }
        }else if(p_data->reg_for_notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle){
            ESP_LOGI(GATTC_TAG, "Battery reg_for_notify handle: %d", p_data->reg_for_notify.handle);

            esp_gatt_status_t ret_status = esp_ble_gattc_get_attr_count( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         ESP_GATT_DB_DESCRIPTOR,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_start_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_service_end_handle,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle,
                                                                         &count);
            if (ret_status != ESP_GATT_OK){
                ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_attr_count error");
            }
            if (count > 0){
                descr_elem_result_BA5C = (esp_gattc_descr_elem_t *)malloc(sizeof(esp_gattc_descr_elem_t) * count);
                if (!descr_elem_result_BA5C){
                    ESP_LOGE(GATTC_TAG, "malloc error, gattc no mem");
                }else{
                    ret_status = esp_ble_gattc_get_descr_by_char_handle( gattc_if,
                                                                         gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                         p_data->reg_for_notify.handle,
                                                                         BA5C_uuid.notify_descr_char_uuid,
                                                                         descr_elem_result_BA5C,
                                                                         &count);
                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_get_descr_by_char_handle error");
                    }

                    /* Erery char have only one descriptor in our 'ESP_GATTS_DEMO' demo, so we used first 'descr_elem_result' */
                    if (count > 0 && descr_elem_result_BA5C[0].uuid.len == ESP_UUID_LEN_16 && descr_elem_result_BA5C[0].uuid.uuid.uuid16 == ESP_GATT_UUID_CHAR_CLIENT_CONFIG){
                        ret_status = esp_ble_gattc_write_char_descr( gattc_if,
                                                                     gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                                                     descr_elem_result_BA5C[0].handle,
                                                                     sizeof(notify_en),
                                                                     (uint8_t *)&notify_en,
                                                                     ESP_GATT_WRITE_TYPE_RSP,
                                                                     ESP_GATT_AUTH_REQ_NONE);
                    }

                    if (ret_status != ESP_GATT_OK){
                        ESP_LOGE(GATTC_TAG, "esp_ble_gattc_write_char_descr decountrror");
                    }

                    /* free descr_elem_result */
                    free(descr_elem_result_BA5C);
                }
            }
            else{
                ESP_LOGE(GATTC_TAG, "decsr not found");
            }
        }

        break;
    }
    case ESP_GATTC_NOTIFY_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_NOTIFY_EVT\n");
        if(p_data->notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_data_char_handle){
            //ESP_LOGI(GATTC_TAG, "PROFILE_BA5C char_handle: %d", p_data->notify.handle);
            ESP_LOGI(GATTC_TAG, "HTU21D receive data notify value:");

