EmbeddedSystemClass/ESP32-IOT-Smart-Home-System/main/src/Bluetooth/esp32iot_bluetooth.c
            //esp_log_buffer_hex(GATTC_TAG, p_data->notify.value, p_data->notify.value_len);

            // BA5C_data.HTU21D_temperature = (p_data->notify.value[1]) | (p_data->notify.value[0] << 8);
            // BA5C_data.HTU21D_humidity = (p_data->notify.value[4]) | (p_data->notify.value[3] << 8);

            BA5C_data.HTU21D_temperature = (p_data->notify.value[1]) | (p_data->notify.value[0] << 8);
            BA5C_data.HTU21D_humidity = (p_data->notify.value[4]) | (p_data->notify.value[3] << 8);
            //ESP_LOGI(GATTC_TAG, "HTU21D_raw: d1=%d | d2=%d", BA5C_data.HTU21D_temperature, BA5C_data.HTU21D_humidity);


            BA5C_data.HTU21D_temperature=-46.85 + 175.72 * BA5C_data.HTU21D_temperature/65536; //(°C) = -46.85 + 175.72 x Temperature Word / 2 16
            BA5C_data.HTU21D_humidity=-6 + 125 * BA5C_data.HTU21D_humidity/65536; //(%RH) = -6 + 125 x Humidity Word / 2 16
            ESP_LOGI(GATTC_TAG, "HTU21D: temperature=%d | humidity=%d", BA5C_data.HTU21D_temperature, BA5C_data.HTU21D_humidity);

            BA5C_data.HTU21D_recived_notification_counter++;
            if(BA5C_data.HTU21D_recived_notification_counter >= read_interval){
                if (esp_ble_gattc_read_char( gattc_if,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_status_char_handle,
                                             ESP_GATT_AUTH_REQ_NONE) != ESP_GATT_OK){
                    ESP_LOGE(GATTC_TAG, "HTU21D status: esp_ble_gattc_get_descr_by_char_handle error");
                }

                if (esp_ble_gattc_read_char( gattc_if,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle,
                                             ESP_GATT_AUTH_REQ_NONE) != ESP_GATT_OK){
                    ESP_LOGE(GATTC_TAG, "Battery data: esp_ble_gattc_get_descr_by_char_handle error");
                }

                BA5C_data.HTU21D_recived_notification_counter = (uint16_t)0;
            }
        }else if(p_data->notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_data_char_handle){
            //ESP_LOGI(GATTC_TAG, "BA5C_MS5637 char_handle: %d", p_data->notify.handle);
            ESP_LOGI(GATTC_TAG, "MS5637 receive data notify value:");

            esp_log_buffer_hex(GATTC_TAG, p_data->notify.value, p_data->notify.value_len);

            BA5C_data.MS5637_D1 = ((p_data->notify.value[2]) ) | ((p_data->notify.value[1] << 8) ) | ((p_data->notify.value[0] << 16) );
            BA5C_data.MS5637_D2 = ((p_data->notify.value[5]) ) | ((p_data->notify.value[4] << 8) ) | ((p_data->notify.value[3] << 16) );

            //ESP_LOGI(GATTC_TAG, "MS5637_raw: D1=%d | D2=%d", BA5C_data.MS5637_D1, BA5C_data.MS5637_D2);


            BA5C_data.MS5637_recived_notification_counter++;
            if(BA5C_data.MS5637_recived_notification_counter >= read_interval){
                if (esp_ble_gattc_read_char( gattc_if,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_calibration_char_handle,
                                             ESP_GATT_AUTH_REQ_NONE) != ESP_GATT_OK){
                    ESP_LOGE(GATTC_TAG, "MS5637 calibration: esp_ble_gattc_get_descr_by_char_handle error");
                }

                if (esp_ble_gattc_read_char( gattc_if,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].conn_id,
                                             gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_status_char_handle,
                                             ESP_GATT_AUTH_REQ_NONE) != ESP_GATT_OK){
                    ESP_LOGE(GATTC_TAG, "MS5637 status: esp_ble_gattc_get_descr_by_char_handle error");
                }
                BA5C_data.MS5637_recived_notification_counter = (uint16_t)0;
            }
        }else if(p_data->notify.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle){
            //ESP_LOGI(GATTC_TAG, "BA5C_Battery char_handle: %d", p_data->notify.handle);
            ESP_LOGI(GATTC_TAG, "Battery receive notify value:");

            esp_log_buffer_hex(GATTC_TAG, p_data->notify.value, p_data->notify.value_len);

            BA5C_data.Battery_level = p_data->notify.value[0];
            BA5C_data.Battery_status = p_data->notify.value[1];

            ESP_LOGI(GATTC_TAG, "Battery: level=%d | status=%d", BA5C_data.Battery_level, BA5C_data.Battery_status);

        }  
        break;
    case ESP_GATTC_READ_CHAR_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_READ_CHAR_EVT");

        if (p_data->read.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "read characteristics failed, error status = %x", p_data->read.status);
            break;
        }

        if(p_data->read.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_status_char_handle){
                //ESP_LOGI(GATTC_TAG, "PROFILE_BA5C char_handle: %d", p_data->read.handle);
            ESP_LOGI(GATTC_TAG, "HTU21D read status value:");

            esp_log_buffer_hex(GATTC_TAG, p_data->read.value, p_data->read.value_len);
            BA5C_data.HTU21D_status=p_data->read.value[0];
            ESP_LOGI(GATTC_TAG, "HTU21D: status=%d", BA5C_data.HTU21D_status);
        }else if(p_data->read.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_calibration_char_handle){
            //ESP_LOGI(GATTC_TAG, "PROFILE_BA5C_MS5637 char_handle: %d", p_data->read.handle);
            ESP_LOGI(GATTC_TAG, "MS5637 read calibration value:");

            //esp_log_buffer_hex(GATTC_TAG, p_data->read.value, p_data->read.value_len);

            /*uint16_t C1 = (p_data->read.value[1]) | (p_data->read.value[0] << 8);
            uint16_t C2 = (p_data->read.value[3]) | (p_data->read.value[2] << 8);
            uint16_t C3 = (p_data->read.value[5]) | (p_data->read.value[4] << 8);
            uint16_t C4 = (p_data->read.value[7]) | (p_data->read.value[6] << 8);
            uint16_t C5 = (p_data->read.value[9]) | (p_data->read.value[8] << 8);
            uint16_t C6 = (p_data->read.value[11]) | (p_data->read.value[10] << 8);

            ESP_LOGI(GATTC_TAG, "MS5637: C1=%d | C2=%d | C3=%d | C4=%d | C5=%d | C6=%d ", C1, C2, C3, C4, C5, C6);
       
            int32_t dT = BA5C_data.MS5637_D2 - C5*256;
            ESP_LOGI(GATTC_TAG, "MS5637: dT=%d ", dT);
            int32_t TEMP = 2000 + dT*C6/8388608;
            BA5C_data.MS5637_temperature = TEMP/100;

