EmbeddedSystemClass/ESP32-IOT-Smart-Home-System/main/src/Bluetooth/esp32iot_bluetooth.c
            int64_t OFF = C2*131072 + (C4*dT)/64;
            int64_t SENS = C1*65536 + (C3*dT)/128;
            ESP_LOGI(GATTC_TAG, "MS5637: OFF=%d | SENS=%d ", (int32_t)OFF, (int32_t)SENS);
            int32_t P = (BA5C_data.MS5637_D1*SENS/2097152 - OFF)/32768;
            BA5C_data.MS5637_pressure = P/100;*/

            //dT = D2 - C5 x 2^8
            int32_t dT = (BA5C_data.MS5637_D2 - ((p_data->read.value[9]) | (p_data->read.value[8] << 8))*pow(2, 8));
            //TEMP = 2000 + dT x C6 / 2^23
            BA5C_data.MS5637_temperature = (2000 + (dT*((p_data->read.value[11]) | (p_data->read.value[10] << 8)))/pow(2, 23))/100;
            //ESP_LOGI(GATTC_TAG, "MS5637: dT=%d ", dT);

            //OFF = C2 x 2^17 + (C4x dT) / 2^6
            int64_t OFF = ((p_data->read.value[3]) | (p_data->read.value[2] << 8))*pow(2, 17) + ((((p_data->read.value[7]) | (p_data->read.value[6] << 8))*dT))/pow(2, 6);
            //SENS = C1 x 2^16 + (C3 x dT)/ 2^7
            int64_t SENS = ((p_data->read.value[1]) | (p_data->read.value[0] << 8))*pow(2, 16) + ((((p_data->read.value[5]) | (p_data->read.value[4] << 8))*dT))/pow(2, 7);          
            //P = (D1 x SENS / 2^21 – OFF) / 2^15
            BA5C_data.MS5637_pressure = ((BA5C_data.MS5637_D1*SENS/pow(2, 21) - OFF)/pow(2, 15))/100;


            //ESP_LOGI(GATTC_TAG, "MS5637: OFF=%d | SENS=%d ", (int)OFF, (int)SENS);
            ESP_LOGI(GATTC_TAG, "MS5637: temperature=%d | pressure=%d", BA5C_data.MS5637_temperature, BA5C_data.MS5637_pressure);
       
        }else if(p_data->read.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_status_char_handle){
            //ESP_LOGI(GATTC_TAG, "PROFILE_BA5C_MS5637 char_handle: %d", p_data->read.handle);
            ESP_LOGI(GATTC_TAG, "MS5637 read status value:");

            esp_log_buffer_hex(GATTC_TAG, p_data->read.value, p_data->read.value_len);

            BA5C_data.MS5637_status=p_data->read.value[0];
            ESP_LOGI(GATTC_TAG, "MS5637: status=%d", BA5C_data.MS5637_status);
        }else if(p_data->read.handle == gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_data_char_handle){
            //ESP_LOGI(GATTC_TAG, "PROFILE_BA5C_Battery char_handle: %d", p_data->read.handle);
            ESP_LOGI(GATTC_TAG, "Battery read data value:");

            esp_log_buffer_hex(GATTC_TAG, p_data->read.value, p_data->read.value_len);

            BA5C_data.Battery_level = p_data->read.value[0];
            BA5C_data.Battery_status = p_data->read.value[1];

            ESP_LOGI(GATTC_TAG, "Battery: level=%d | status=%d", BA5C_data.Battery_level, BA5C_data.Battery_status);
        }

        break;
    case ESP_GATTC_QUEUE_FULL_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_QUEUE_FULL_EVT");

        if (p_data->queue_full.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "write descr failed, error status = %x", p_data->queue_full.status);
            break;
        }
        //bta_gattc_free_command_data(tBTA_GATTC_CLCB *p_clcb)
        break;
    case ESP_GATTC_WRITE_DESCR_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_WRITE_DESCR_EVT");

        if (p_data->write.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "write descr failed, error status = %x", p_data->write.status);
            break;
        }
        ESP_LOGI(GATTC_TAG, "write descr success");
        break;
    case ESP_GATTC_WRITE_CHAR_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_WRITE_CHAR_EVT");

        if (p_data->write.status != ESP_GATT_OK){
            ESP_LOGE(GATTC_TAG, "write char failed, error status = %x", p_data->write.status);
        }else{
            ESP_LOGI(GATTC_TAG, "write char success");
        }
        start_scan();
        break;
    case ESP_GATTC_SRVC_CHG_EVT: {
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_SRVC_CHG_EVT");

        esp_bd_addr_t bda;
        memcpy(bda, p_data->srvc_chg.remote_bda, sizeof(esp_bd_addr_t));
        ESP_LOGI(GATTC_TAG, "bd_addr:%08x%04x",(bda[0] << 24) + (bda[1] << 16) + (bda[2] << 8) + bda[3],
                 (bda[4] << 8) + bda[5]);
        break;
    }
    case ESP_GATTC_DISCONNECT_EVT:
        ESP_LOGI(GATTC_TAG, "BA5C ESP_GATTC_DISCONNECT_EVT");

        //Start scanning again
        start_scan();
        if (memcmp(p_data->disconnect.remote_bda, gl_profile_tab[PROFILE_BA5C_APP_ID].remote_bda, 6) == 0){
            ESP_LOGI(GATTC_TAG, "device a disconnect");
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.conn_device = false;

            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.HTU21D_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.MS5637_get_service = false;
            gl_profile_tab[PROFILE_BA5C_APP_ID].BA5C_handle_data.Battery_get_service = false;
            
        }
        break;
    default:
        ESP_LOGI(GATTC_TAG, "BA5C unhandled event: %d", event);

        break;
    }
}

static void esp_gap_cb(esp_gap_ble_cb_event_t event, esp_ble_gap_cb_param_t *param)
{
    uint8_t *adv_name = NULL;
    uint8_t adv_name_len = 0;
    switch (event) {
    case ESP_GAP_BLE_UPDATE_CONN_PARAMS_EVT:
         ESP_LOGI(GATTC_TAG, "update connetion params status = %d, min_int = %d, max_int = %d,conn_int = %d,latency = %d, timeout = %d",
                  param->update_conn_params.status,
                  param->update_conn_params.min_int,
                  param->update_conn_params.max_int,
                  param->update_conn_params.conn_int,
                  param->update_conn_params.latency,
                  param->update_conn_params.timeout);
        break;
    case ESP_GAP_BLE_SCAN_PARAM_SET_COMPLETE_EVT: {
        //the unit of the duration is second
        uint32_t duration = 30;
        esp_ble_gap_start_scanning(duration);
        break;
    }
    case ESP_GAP_BLE_SCAN_START_COMPLETE_EVT:
        //scan start complete event to indicate scan start successfully or failed
        if (param->scan_start_cmpl.status == ESP_BT_STATUS_SUCCESS) {
            ESP_LOGI(GATTC_TAG, "Scan start success");
        }else{
            ESP_LOGE(GATTC_TAG, "Scan start failed");
        }
        break;
    case ESP_GAP_BLE_SCAN_RESULT_EVT: {
        esp_ble_gap_cb_param_t *scan_result = (esp_ble_gap_cb_param_t *)param;
        switch (scan_result->scan_rst.search_evt) {
        case ESP_GAP_SEARCH_INQ_RES_EVT:
            esp_log_buffer_hex(GATTC_TAG, scan_result->scan_rst.bda, 6);
            ESP_LOGI(GATTC_TAG, "Searched Adv Data Len %d, Scan Response Len %d", scan_result->scan_rst.adv_data_len, scan_result->scan_rst.scan_rsp_len);
            adv_name = esp_ble_resolve_adv_data(scan_result->scan_rst.ble_adv,
                                                ESP_BLE_AD_TYPE_NAME_CMPL, &adv_name_len);
            ESP_LOGI(GATTC_TAG, "Searched Device Name Len %d\n", adv_name_len);
            esp_log_buffer_char(GATTC_TAG, adv_name, adv_name_len);

